IDEA Open Model
NonConformity Class
Compatible with IDEA StatiCa 20.1
 Non-conformity
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Message.NonConformity
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class NonConformity
Public Class NonConformity
The NonConformity type exposes the following members.
Constructors
Name | Description
NonConformity
 Constructor
Top
Properties
Name | Description
Guid
 Description of the nonconformity
Severity
 severity of this nonconformity
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace